Revit 2024 API
BuildingEnvelopeAnalyzerOptions Constructor
 Constructs a new instance of BuildingEnvelopeAnalyzerOptions, using default values.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public BuildingEnvelopeAnalyzerOptions()
Visual Basic
Public Sub New
Visual C++
public:
BuildingEnvelopeAnalyzerOptions()
See Also
BuildingEnvelopeAnalyzerOptions Class
Autodesk.Revit.DB.Analysis Namespace